pet_examples/evaluation/model_comp_corr/gpt3/graphviz/rulact/3_3.gv
digraph G {
  rankdir=LR;
  start_1[shape=circle label=""];
  task_1[shape=rectangle label="Examine claim"];
  task_2[shape=rectangle label="Write recommendation"];
  seg_1[shape=diamond label="X"];
  task_3[shape=rectangle label="Check recommendation"];
  task_4[shape=rectangle label="Mark claim"];
  spg_1[shape=diamond label="AND"];
  task_5[shape=rectangle label="Send back"];
  task_6[shape=rectangle label="Repeat recommendation"];
  task_7[shape=rectangle label="Proceed"];
  end_1[shape=doublecircle label=""];
  start_1 -> task_1;
  task_1 -> task_2;
  task_2 -> seg_1;
  seg_1 -> task_3[label="OK"];
  seg_1 -> task_4[label="Not OK"];
  task_3 -> spg_1;
  task_4 -> spg_1;
  spg_1 -> task_5;
  spg_1 -> task_6;
  task_5 -> task_2;
  task_6 -> task_2;
  task_7 -> end_1;
}
